mikeakohn/naken_asm/include/8051/stc32g.inc
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; STC32G include
;; part of the naken_asm assembler
;;
;; Generated by: Cjacker Huang (cjacker@gmail.com)
;;         Date: 2022-05-21
;;        Parts: STC32G
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

DPXL equ 0x84
SPH equ 0x85
INTCLKO equ 0x8f
P1M1 equ 0x91
P1M0 equ 0x92
P0M1 equ 0x93
P0M0 equ 0x94
P2M1 equ 0x95
P2M0 equ 0x96
AUXR2 equ 0x97
S2CON equ 0x9a
S2BUF equ 0x9b
IRCBAND equ 0x9d
LIRTRIM equ 0x9e
IRTRIM equ 0x9f
BUS_SPEED equ 0xa1
P_SW1 equ 0xa2
V33TRIM equ 0xa3
BGTRIM equ 0xa5
VRTRIM equ 0xa6
SADDR equ 0xa9
WKTCL equ 0xaa
WKTCH equ 0xab
S3CON equ 0xac
S3BUF equ 0xad
TA equ 0xae
IE2 equ 0xaf
P3M1 equ 0xb1
P3M0 equ 0xb2
P4M1 equ 0xb3
P4M0 equ 0xb4
IP2 equ 0xb5
IP2H equ 0xb6
IPH equ 0xb7
SADEN equ 0xb9
P_SW2 equ 0xba
P_SW3 equ 0xbb
ADC_CONTR equ 0xbc
ADC_RES equ 0xbd
ADC_RESL equ 0xbe
WDT_CONTR equ 0xc1
IAP_DATA equ 0xc2
IAP_ADDRH equ 0xc3
IAP_ADDRL equ 0xc4
IAP_CMD equ 0xc5
IAP_TRIG equ 0xc6
IAP_CONTR equ 0xc7
P5M1 equ 0xc9
P5M0 equ 0xca
P6M1 equ 0xcb
P6M0 equ 0xcc
SPSTAT equ 0xcd
SPCTL equ 0xce
SPDAT equ 0xcf
PSW1 equ 0xd1
T4H equ 0xd2
T4L equ 0xd3
T3H equ 0xd4
T3L equ 0xd5
T2H equ 0xd6
T2L equ 0xd7
USBCLK equ 0xdc
T4T3M equ 0xdd
ADCCFG equ 0xde
IP3 equ 0xdf
P7M1 equ 0xe1
P7M0 equ 0xe2
DPS equ 0xe3
DPL1 equ 0xe4
DPH1 equ 0xe5
CMPCR1 equ 0xe6
CMPCR2 equ 0xe7
WTST equ 0xe9
CKCON equ 0xea
MXAX equ 0xeb
USBDAT equ 0xec
DMAIR equ 0xed
IP3H equ 0xee
AUXINTIF equ 0xef
CANICR equ 0xf1
USBCON equ 0xf4
IAP_TPS equ 0xf5
IAP_ADDRE equ 0xf6
ICHECR equ 0xf7
LINICR equ 0xf9
LINAR equ 0xfa
LINDR equ 0xfb
USBADR equ 0xfc
S4CON equ 0xfd
S4BUF equ 0xfe
RSTCFG equ 0xff

; xdata

CLKSEL equ 0x7efe00
CLKDIV equ 0x7efe01
HIRCCR equ 0x7efe02
XOSCCR equ 0x7efe03
IRC32KCR equ 0x7efe04
MCLKOCR equ 0x7efe05
IRCDB equ 0x7efe06
IRC48MCR equ 0x7efe07
X32KCR equ 0x7efe08
IRC48ATRIM equ 0x7efe09
IRC48BTRIM equ 0x7efe0a
HSCLKDIV equ 0x7efe0b
P0PU equ 0x7efe10
P1PU equ 0x7efe11
P2PU equ 0x7efe12
P3PU equ 0x7efe13
P4PU equ 0x7efe14
P5PU equ 0x7efe15
P6PU equ 0x7efe16
P7PU equ 0x7efe17
P0NCS equ 0x7efe18
P1NCS equ 0x7efe19
P2NCS equ 0x7efe1a
P3NCS equ 0x7efe1b
P4NCS equ 0x7efe1c
P5NCS equ 0x7efe1d
P6NCS equ 0x7efe1e
P7NCS equ 0x7efe1f
P0SR equ 0x7efe20
P1SR equ 0x7efe21
P2SR equ 0x7efe22
P3SR equ 0x7efe23
P4SR equ 0x7efe24
P5SR equ 0x7efe25
P6SR equ 0x7efe26
P7SR equ 0x7efe27
P0DR equ 0x7efe28
P1DR equ 0x7efe29
P2DR equ 0x7efe2a
P3DR equ 0x7efe2b
P4DR equ 0x7efe2c
P5DR equ 0x7efe2d
P6DR equ 0x7efe2e
P7DR equ 0x7efe2f
P0IE equ 0x7efe30
P1IE equ 0x7efe31
P2IE equ 0x7efe32
P3IE equ 0x7efe33
P4IE equ 0x7efe34
P5IE equ 0x7efe35
P6IE equ 0x7efe36
P7IE equ 0x7efe37
LCMIFCFG equ 0x7efe50
LCMIFCFG2 equ 0x7efe51
LCMIFCR equ 0x7efe52
LCMIFSTA equ 0x7efe53
LCMIFDATL equ 0x7efe54
LCMIFDATH equ 0x7efe55
RTCCR equ 0x7efe60
RTCCFG equ 0x7efe61
RTCIEN equ 0x7efe62
RTCIF equ 0x7efe63
ALAHOUR equ 0x7efe64
ALAMIN equ 0x7efe65
ALASEC equ 0x7efe66
ALASSEC equ 0x7efe67
INIYEAR equ 0x7efe68
INIMONTH equ 0x7efe69
INIDAY equ 0x7efe6a
INIHOUR equ 0x7efe6b
INIMIN equ 0x7efe6c
INISEC equ 0x7efe6d
INISSEC equ 0x7efe6e
YEAR equ 0x7efe70
MONTH equ 0x7efe71
DAY equ 0x7efe72
HOUR equ 0x7efe73
MIN equ 0x7efe74
SEC equ 0x7efe75
SSEC equ 0x7efe76
I2CCFG equ 0x7efe80
I2CMSCR equ 0x7efe81
I2CMSST equ 0x7efe82
I2CSLCR equ 0x7efe83
I2CSLST equ 0x7efe84
I2CSLADR equ 0x7efe85
I2CTXD equ 0x7efe86
I2CRXD equ 0x7efe87
I2CMSAUX equ 0x7efe88
SPFUNC equ 0x7efe98
RSTFLAG equ 0x7efe99
RSTCR0 equ 0x7efe9a
RSTCR1 equ 0x7efe9b
RSTCR2 equ 0x7efe9c
RSTCR3 equ 0x7efe9d
RSTCR4 equ 0x7efe9e
RSTCR5 equ 0x7efe9f
TM0PS equ 0x7efea0
TM1PS equ 0x7efea1
TM2PS equ 0x7efea2
TM3PS equ 0x7efea3
TM4PS equ 0x7efea4
ADCTIM equ 0x7efea8
T3T4PS equ 0x7efeac
ADCEXCFG equ 0x7efead
CMPEXCFG equ 0x7efeae
PWMA_ETRPS equ 0x7efeb0
PWMA_ENO equ 0x7efeb1
PWMA_PS equ 0x7efeb2
PWMA_IOAUX equ 0x7efeb3
PWMB_ETRPS equ 0x7efeb4
PWMB_ENO equ 0x7efeb5
PWMB_PS equ 0x7efeb6
PWMB_IOAUX equ 0x7efeb7
CANAR equ 0x7efebb
CANDR equ 0x7efebc
PWMA_CR1 equ 0x7efec0
PWMA_CR2 equ 0x7efec1
PWMA_SMCR equ 0x7efec2
PWMA_ETR equ 0x7efec3
PWMA_IER equ 0x7efec4
PWMA_SR1 equ 0x7efec5
PWMA_SR2 equ 0x7efec6
PWMA_EGR equ 0x7efec7
PWMA_CCMR1 equ 0x7efec8
PWMA_CCMR2 equ 0x7efec9
PWMA_CCMR3 equ 0x7efeca
PWMA_CCMR4 equ 0x7efecb
PWMA_CCER1 equ 0x7efecc
PWMA_CCER2 equ 0x7efecd
PWMA_CNTRH equ 0x7efece
PWMA_CNTRL equ 0x7efecf
PWMA_PSCRH equ 0x7efed0
PWMA_PSCRL equ 0x7efed1
PWMA_ARRH equ 0x7efed2
PWMA_ARRL equ 0x7efed3
PWMA_RCR equ 0x7efed4
PWMA_CCR1H equ 0x7efed5
PWMA_CCR1L equ 0x7efed6
PWMA_CCR2H equ 0x7efed7
PWMA_CCR2L equ 0x7efed8
PWMA_CCR3H equ 0x7efed9
PWMA_CCR3L equ 0x7efeda
PWMA_CCR4H equ 0x7efedb
PWMA_CCR4L equ 0x7efedc
PWMA_BKR equ 0x7efedd
PWMA_DTR equ 0x7efede
PWMA_OISR equ 0x7efedf
PWMB_CR1 equ 0x7efee0
PWMB_CR2 equ 0x7efee1
PWMB_SMCR equ 0x7efee2
PWMB_ETR equ 0x7efee3
PWMB_IER equ 0x7efee4
PWMB_SR1 equ 0x7efee5
PWMB_SR2 equ 0x7efee6
PWMB_EGR equ 0x7efee7
PWMB_CCMR1 equ 0x7efee8
PWMB_CCMR2 equ 0x7efee9
PWMB_CCMR3 equ 0x7efeea
PWMB_CCMR4 equ 0x7efeeb
PWMB_CCER1 equ 0x7efeec
PWMB_CCER2 equ 0x7efeed
PWMB_CNTRH equ 0x7efeee
PWMB_CNTRL equ 0x7efeef
PWMB_PSCRH equ 0x7efef0
PWMB_PSCRL equ 0x7efef1
PWMB_ARRH equ 0x7efef2
PWMB_ARRL equ 0x7efef3
PWMB_RCR equ 0x7efef4
PWMB_CCR1H equ 0x7efef5
PWMB_CCR1L equ 0x7efef6
PWMB_CCR2H equ 0x7efef7
PWMB_CCR2L equ 0x7efef8
PWMB_CCR3H equ 0x7efef9
PWMB_CCR3L equ 0x7efefa
PWMB_CCR4H equ 0x7efefb
PWMB_CCR4L equ 0x7efefc
PWMB_BKR equ 0x7efefd
PWMB_DTR equ 0x7efefe
PWMB_OISR equ 0x7efeff
PWMA equ 0x7efec0
PWMB equ 0x7efee0
PWM2_OISR equ 0x7efeff
P0INTE equ 0x7efd00
P1INTE equ 0x7efd01
P2INTE equ 0x7efd02
P3INTE equ 0x7efd03
P4INTE equ 0x7efd04
P5INTE equ 0x7efd05
P6INTE equ 0x7efd06
P7INTE equ 0x7efd07
P0INTF equ 0x7efd10
P1INTF equ 0x7efd11
P2INTF equ 0x7efd12
P3INTF equ 0x7efd13
P4INTF equ 0x7efd14
P5INTF equ 0x7efd15
P6INTF equ 0x7efd16
P7INTF equ 0x7efd17
P0IM0 equ 0x7efd20
P1IM0 equ 0x7efd21
P2IM0 equ 0x7efd22
P3IM0 equ 0x7efd23
P4IM0 equ 0x7efd24
P5IM0 equ 0x7efd25
P6IM0 equ 0x7efd26
P7IM0 equ 0x7efd27
P0IM1 equ 0x7efd30
P1IM1 equ 0x7efd31
P2IM1 equ 0x7efd32
P3IM1 equ 0x7efd33
P4IM1 equ 0x7efd34
P5IM1 equ 0x7efd35
P6IM1 equ 0x7efd36
P7IM1 equ 0x7efd37
P0WKUE equ 0x7efd40
P1WKUE equ 0x7efd41
P2WKUE equ 0x7efd42
P3WKUE equ 0x7efd43
P4WKUE equ 0x7efd44
P5WKUE equ 0x7efd45
P6WKUE equ 0x7efd46
P7WKUE equ 0x7efd47
PIN_IP equ 0x7efd60
PIN_IPH equ 0x7efd61
S2CFG equ 0x7efdb4
S2ADDR equ 0x7efdb5
S2ADEN equ 0x7efdb6
USARTCR1 equ 0x7efdc0
USARTCR2 equ 0x7efdc1
USARTCR3 equ 0x7efdc2
USARTCR4 equ 0x7efdc3
USARTCR5 equ 0x7efdc4
USARTGTR equ 0x7efdc5
USARTBRH equ 0x7efdc6
USARTBRL equ 0x7efdc7
USART2CR1 equ 0x7efdc8
USART2CR2 equ 0x7efdc9
USART2CR3 equ 0x7efdca
USART2CR4 equ 0x7efdcb
USART2CR5 equ 0x7efdcc
USART2GTR equ 0x7efdcd
USART2BRH equ 0x7efdce
USART2BRL equ 0x7efdcf
CHIPID equ 0x7efde0
CHIPID0 equ 0x7efde0
CHIPID1 equ 0x7efde1
CHIPID2 equ 0x7efde2
CHIPID3 equ 0x7efde3
CHIPID4 equ 0x7efde4
CHIPID5 equ 0x7efde5
CHIPID6 equ 0x7efde6
CHIPID7 equ 0x7efde7
CHIPID8 equ 0x7efde8
CHIPID9 equ 0x7efde9
CHIPID10 equ 0x7efdea
CHIPID11 equ 0x7efdeb
CHIPID12 equ 0x7efdec
CHIPID13 equ 0x7efded
CHIPID14 equ 0x7efdee
CHIPID15 equ 0x7efdef
CHIPID16 equ 0x7efdf0
CHIPID17 equ 0x7efdf1
CHIPID18 equ 0x7efdf2
CHIPID19 equ 0x7efdf3
CHIPID20 equ 0x7efdf4
CHIPID21 equ 0x7efdf5
CHIPID22 equ 0x7efdf6
CHIPID23 equ 0x7efdf7
CHIPID24 equ 0x7efdf8
CHIPID25 equ 0x7efdf9
CHIPID26 equ 0x7efdfa
CHIPID27 equ 0x7efdfb
CHIPID28 equ 0x7efdfc
CHIPID29 equ 0x7efdfd
CHIPID30 equ 0x7efdfe
CHIPID31 equ 0x7efdff
HSPWMA_CFG equ 0x7efbf0
HSPWMA_ADR equ 0x7efbf1
HSPWMA_DAT equ 0x7efbf2
HSPWMB_CFG equ 0x7efbf4
HSPWMB_ADR equ 0x7efbf5
HSPWMB_DAT equ 0x7efbf6
HSSPI_CFG equ 0x7efbf8
HSSPI_CFG2 equ 0x7efbf9
HSSPI_STA equ 0x7efbfa
DMA_M2M_CFG equ 0x7efa00
DMA_M2M_CR equ 0x7efa01
DMA_M2M_STA equ 0x7efa02
DMA_M2M_AMT equ 0x7efa03
DMA_M2M_DONE equ 0x7efa04
DMA_M2M_TXAH equ 0x7efa05
DMA_M2M_TXAL equ 0x7efa06
DMA_M2M_RXAH equ 0x7efa07
DMA_M2M_RXAL equ 0x7efa08
DMA_ADC_CFG equ 0x7efa10
DMA_ADC_CR equ 0x7efa11
DMA_ADC_STA equ 0x7efa12
DMA_ADC_RXAH equ 0x7efa17
DMA_ADC_RXAL equ 0x7efa18
DMA_ADC_CFG2 equ 0x7efa19
DMA_ADC_CHSW0 equ 0x7efa1a
DMA_ADC_CHSW1 equ 0x7efa1b
DMA_SPI_CFG equ 0x7efa20
DMA_SPI_CR equ 0x7efa21
DMA_SPI_STA equ 0x7efa22
DMA_SPI_AMT equ 0x7efa23
DMA_SPI_DONE equ 0x7efa24
DMA_SPI_TXAH equ 0x7efa25
DMA_SPI_TXAL equ 0x7efa26
DMA_SPI_RXAH equ 0x7efa27
DMA_SPI_RXAL equ 0x7efa28
DMA_SPI_CFG2 equ 0x7efa29
DMA_UR1T_CFG equ 0x7efa30
DMA_UR1T_CR equ 0x7efa31
DMA_UR1T_STA equ 0x7efa32
DMA_UR1T_AMT equ 0x7efa33
DMA_UR1T_DONE equ 0x7efa34
DMA_UR1T_TXAH equ 0x7efa35
DMA_UR1T_TXAL equ 0x7efa36
DMA_UR1R_CFG equ 0x7efa38
DMA_UR1R_CR equ 0x7efa39
DMA_UR1R_STA equ 0x7efa3a
DMA_UR1R_AMT equ 0x7efa3b
DMA_UR1R_DONE equ 0x7efa3c
DMA_UR1R_RXAH equ 0x7efa3d
DMA_UR1R_RXAL equ 0x7efa3e
DMA_UR2T_CFG equ 0x7efa40
DMA_UR2T_CR equ 0x7efa41
DMA_UR2T_STA equ 0x7efa42
DMA_UR2T_AMT equ 0x7efa43
DMA_UR2T_DONE equ 0x7efa44
DMA_UR2T_TXAH equ 0x7efa45
DMA_UR2T_TXAL equ 0x7efa46
DMA_UR2R_CFG equ 0x7efa48
DMA_UR2R_CR equ 0x7efa49
DMA_UR2R_STA equ 0x7efa4a
DMA_UR2R_AMT equ 0x7efa4b
DMA_UR2R_DONE equ 0x7efa4c
DMA_UR2R_RXAH equ 0x7efa4d
DMA_UR2R_RXAL equ 0x7efa4e
DMA_UR3T_CFG equ 0x7efa50
DMA_UR3T_CR equ 0x7efa51
DMA_UR3T_STA equ 0x7efa52
DMA_UR3T_AMT equ 0x7efa53
DMA_UR3T_DONE equ 0x7efa54
DMA_UR3T_TXAH equ 0x7efa55
DMA_UR3T_TXAL equ 0x7efa56
DMA_UR3R_CFG equ 0x7efa58
DMA_UR3R_CR equ 0x7efa59
DMA_UR3R_STA equ 0x7efa5a
DMA_UR3R_AMT equ 0x7efa5b
DMA_UR3R_DONE equ 0x7efa5c
DMA_UR3R_RXAH equ 0x7efa5d
DMA_UR3R_RXAL equ 0x7efa5e
DMA_UR4T_CFG equ 0x7efa60
DMA_UR4T_CR equ 0x7efa61
DMA_UR4T_STA equ 0x7efa62
DMA_UR4T_AMT equ 0x7efa63
DMA_UR4T_DONE equ 0x7efa64
DMA_UR4T_TXAH equ 0x7efa65
DMA_UR4T_TXAL equ 0x7efa66
DMA_UR4R_CFG equ 0x7efa68
DMA_UR4R_CR equ 0x7efa69
DMA_UR4R_STA equ 0x7efa6a
DMA_UR4R_AMT equ 0x7efa6b
DMA_UR4R_DONE equ 0x7efa6c
DMA_UR4R_RXAH equ 0x7efa6d
DMA_UR4R_RXAL equ 0x7efa6e
DMA_LCM_CFG equ 0x7efa70
DMA_LCM_CR equ 0x7efa71
DMA_LCM_STA equ 0x7efa72
DMA_LCM_AMT equ 0x7efa73
DMA_LCM_DONE equ 0x7efa74
DMA_LCM_TXAH equ 0x7efa75
DMA_LCM_TXAL equ 0x7efa76
DMA_LCM_RXAH equ 0x7efa77
DMA_LCM_RXAL equ 0x7efa78
DMA_M2M_AMTH equ 0x7efa80
DMA_M2M_DONEH equ 0x7efa81
DMA_SPI_AMTH equ 0x7efa84
DMA_SPI_DONEH equ 0x7efa85
DMA_LCM_AMTH equ 0x7efa86
DMA_LCM_DONEH equ 0x7efa87
DMA_UR1T_AMTH equ 0x7efa88
DMA_UR1T_DONEH equ 0x7efa89
DMA_UR1R_AMTH equ 0x7efa8a
DMA_UR1R_DONEH equ 0x7efa8b
DMA_UR2T_AMTH equ 0x7efa8c
DMA_UR2T_DONEH equ 0x7efa8d
DMA_UR2R_AMTH equ 0x7efa8e
DMA_UR2R_DONEH equ 0x7efa8f
DMA_UR3T_AMTH equ 0x7efa90
DMA_UR3T_DONEH equ 0x7efa91
DMA_UR3R_AMTH equ 0x7efa92
DMA_UR3R_DONEH equ 0x7efa93
DMA_UR4T_AMTH equ 0x7efa94
DMA_UR4T_DONEH equ 0x7efa95
DMA_UR4R_AMTH equ 0x7efa96
DMA_UR4R_DONEH equ 0x7efa97
DMA_I2CT_CFG equ 0x7efa98
DMA_I2CT_CR equ 0x7efa99
DMA_I2CT_STA equ 0x7efa9a
DMA_I2CT_AMT equ 0x7efa9b
DMA_I2CT_DONE equ 0x7efa9c
DMA_I2CT_TXAH equ 0x7efa9d
DMA_I2CT_TXAL equ 0x7efa9e
DMA_I2CR_CFG equ 0x7efaa0
DMA_I2CR_CR equ 0x7efaa1
DMA_I2CR_STA equ 0x7efaa2
DMA_I2CR_AMT equ 0x7efaa3
DMA_I2CR_DONE equ 0x7efaa4
DMA_I2CR_RXAH equ 0x7efaa5
DMA_I2CR_RXAL equ 0x7efaa6
DMA_I2CT_AMTH equ 0x7efaa8
DMA_I2CT_DONEH equ 0x7efaa9
DMA_I2CR_AMTH equ 0x7efaaa
DMA_I2CR_DONEH equ 0x7efaab
DMA_I2C_CR equ 0x7efaad
DMA_I2C_ST1 equ 0x7efaae
DMA_I2C_ST2 equ 0x7efaaf
